package com.korit.basic.chapter04;

/*
    객체지향 프로그래밍
    // OOP(Object-Oriented Programming)
*/

// 1. 객체?
// : 데이터(속성)와 해당 데이터를 처리하는 방법(메서드)을 포함하는 프로그래밍의 기본 단위

// 객체의 예시
// EX) 커피 자판기
// > 속성 : 커피의 종류, 가격, 현재 재고, 물의 온도...
// > 기능 : 커피 제조, 재고 관리, 가격 설정...

// EX) 학교 관리 '시스템'
// 학생 객체
// 속성 : 이름, 학번, 수강과목... 데이터
// 기능 : 성적 조회, 수강 신청... 행위

// 교수 객체
// 속성 : 이름, 연구 분야, 담당 과목... 데이터
// 기능 : 강의 계획서 업로드, 성적 입력... 행위

// 수업 객체
// 속성 : 과목명, 강의실, 강의 시간 ... 데이터
// 기능 : 강의 자료 업로드, 출석 체크 ... 행위

public class Object01 {
    public static void main(String[] args) {

    }
}
